heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf_working/esb_prx_w/main.c
/**
 * Copyright (c) 2014 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "nrf_esb.h"

#include <stdbool.h>
#include <stdint.h>
#include "sdk_common.h"
#include "nrf.h"
#include "nrf_esb_error_codes.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_error.h"
#include "boards.h"


#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

void        pingPacket(void);
uint32_t    esb_init1( void );
uint32_t    esb_init( void );
uint32_t    set_slave_adress(uint8_t slaveid,uint8_t *base_address);
void        scan_device(uint8_t length);
void reTransmit(void);
void doDiagnosticTest(void);



uint8_t led_nr;
uint8_t Fwrd_Dirct = 0;
uint8_t Rvsr_Dirct = 0;

nrf_esb_payload_t rx_payload;

static nrf_esb_payload_t        tx_payload = NRF_ESB_CREATE_PAYLOAD(0, 0x01, 0x00, 0x00, 0x00, 0x11, 0x00, 0x00, 0x00);

/*lint -save -esym(40, BUTTON_1) -esym(40, BUTTON_2) -esym(40, BUTTON_3) -esym(40, BUTTON_4) -esym(40, LED_1) -esym(40, LED_2) -esym(40, LED_3) -esym(40, LED_4) */
#define PACKET_HEADER_SIZE                 sizeof(Packet_Header)
#define START_BYTE                         PACKET_HEADER_SIZE



#define     ARRAY_SIZE            4
#define     MAX_CIRCLE            4
#define     MAX_NEIGHBORS         10
#define     MIN_CIRCLE            0

#define     POS_PACKET_TYPE       0
#define     POS_DIRECTION         1
#define     POS_LENGTH            2
#define     POS_CIRCLE_ARRAY      4
#define     POS_RESERVED          8

#define     FORWARD               1
#define     BACKWORD              0  
#define     MIN_NODES             0
#define     MAX_NODES             255
#define     SUCCES                1
#define     FAILURE               0


#define check_direction(arrptr) \
    (((arrptr)[6]  == 1) ? (Fwrd_Dirct = 1) : (Rvsr_Dirct = 1))



uint8_t arrays[MAX_CIRCLE][ARRAY_SIZE] =
{
    {0x0A, 0x0A, 0x0A, 0x0A},   // ARRAY_1
    {0x0B, 0x0B, 0x0B, 0x0B},   // ARRAY_2
    {0x0C, 0x0C, 0x0C, 0x0C},   // ARRAY_3
    {0x0D, 0x0D, 0x0D, 0x0D}    // ARRAY_4
};



uint8_t base_addr_0[4] = {0xE7, 0xE7, 0xE7, 0xE7};
uint8_t base_addr_1[4] = {0xC1, 0xC1, 0xC1, 0xC1};
uint8_t addr_prefix[8] = {0x20};


uint8_t received_data = 0;


typedef struct
{
    uint16_t node_id;       // Neighbor ID
    int8_t   rssi;          // Signal strength
    //uint8_t  hop_count;     // Distance to sink
    //uint32_t last_seen;     // Timestamp
    //uint8_t  valid;         // Entry active
    uint8_t dirtyflag;
} neighbor_t;
 
neighbor_t Nxt_neighbor_table[MAX_NEIGHBORS];
neighbor_t Prev_neighbor_table[MAX_NEIGHBORS];


typedef struct
{
    uint8_t node_id;
    uint8_t circle_no;
    //uint8_t  hop_count;
    //uint8_t  seq;
} adv_packet_t;

adv_packet_t advertisment_pcket;

#if 0

struct __attribute__((packed)) Packet_Header
{
uint8_t circle_array[MAX_CIRCLE];
uint16_t length;
uint8_t Direction;
uint8_t reserved;
uint8_t packet_type; 
};


#else
struct __attribute__((packed)) Packet_Header
{
      uint8_t   packet_type;
      uint8_t   Direction;
      uint16_t  length;
      uint8_t   circle_array[MAX_CIRCLE];
      uint8_t   reserved;
};
#endif

struct Packet_Header Packet_Header;
uint8_t selected_pipe = 0;
uint8_t volatile Mater_Data_received = 0;
uint8_t volatile Mater_Data_Sent = 0;
uint8_t volatile Slave_Data_received = 0;
uint8_t volatile Slave_Data_Sent = 0;
uint8_t itr ;
uint16_t length = 0;
uint8_t i = 0;
uint8_t sent_bytes_count = 0;
nrf_esb_payload_t rx_payload;
uint8_t Circle_No = 0;
uint8_t Current_Circle = 2;
uint8_t Send_Data_To_Nxt_Slave = 0;

uint8_t uartbuff[2048];
uint8_t Ack_Txing = 0;
uint8_t Actd[15];
uint8_t *circlearr;
uint8_t Nxt_table_index;
uint8_t Prev_table_index;
uint8_t neighbour_no;
uint8_t TxFailFlag = 0;


struct Packet_Header header;


void select_slave(uint8_t slave_id)
{
    // slave_id must match the pipe number configured on the slave
    selected_pipe = slave_id;
}

void sort_neighbors_by_rssi(neighbor_t *table, int n)
{
    for (int i = 1; i < n; i++)
    {
        neighbor_t key = table[i];
        int j = i - 1;

        while (j >= 0 && table[j].rssi < key.rssi)
        {
            table[j + 1] = table[j];
            j--;
        }
        table[j + 1] = key;
    }
}


void Construct_DLMS_Packet(void)
{
   
  if(circlearr[Current_Circle] == addr_prefix[0])
  {
   memcpy(&header, rx_payload.data,sizeof(header));
  if(rx_payload.data[START_BYTE] == 0x7E)
    {
            if((rx_payload.data[START_BYTE + 2]))
            {
                    length = (((rx_payload.data[START_BYTE +1] & 0x07) << 8) | rx_payload.data[START_BYTE +2]);
                    length += 2;
            }
            i = 0;

