heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf_working/esb_prx_w/main.c
          }
          if(circlearr[POS_PACKET_TYPE] == 1  && circlearr[POS_LENGTH] == 1)
          {
                advertisment_pcket.circle_no = Current_Circle;
                advertisment_pcket.node_id = addr_prefix[0];
                memset(&header,0,sizeof(header));
                header.length = 0;
                header.packet_type = 1;
                if(circlearr[(POS_CIRCLE_ARRAY + Current_Circle) - 1] != 0 && Current_Circle != 0)
                {
                      header.Direction = BACKWORD;
                }
                else
                {
                      header.Direction = FORWARD;
                }
                memcpy(tx_payload.data,&header,sizeof(header));
                memcpy(tx_payload.data + sizeof(header), &advertisment_pcket, sizeof(advertisment_pcket));
                tx_payload.length = sizeof(header) + sizeof(advertisment_pcket);
                check_direction(tx_payload.data);
          }
}


void clocks_start( void )
{
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0);
}


void gpio_init( void )
{
    bsp_board_init(BSP_INIT_LEDS);
}

void nrf_set_txmode(void)
{
    uint32_t err_code;
     nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.payload_length           = 8;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.selective_auto_ack       = false;

    err_code = nrf_esb_init(&nrf_esb_config);
    //VERIFY_SUCCESS(err_code);
}



uint32_t esb_init( void )
{

    uint32_t err_code;

    nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.retransmit_delay         = 600;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.selective_auto_ack       = false;


    err_code = nrf_esb_init(&nrf_esb_config);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_0(arrays[Current_Circle]);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(addr_prefix, 1);
    VERIFY_SUCCESS(err_code);

    return err_code;
}

uint32_t set_slave_adress(uint8_t slaveid,uint8_t *base_address)
{

    uint32_t err_code;

    err_code = nrf_esb_set_base_address_0(base_address);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(&slaveid, 1);
    VERIFY_SUCCESS(err_code);
    nrf_esb_flush_tx();
    nrf_esb_flush_rx();


    return err_code;
}

#define	POW_CNTRL_PIN	7
uint8_t autohealing = 0;
uint8_t Diagnostic_Test = 0;

void doDiagnosticTest(void)
{       
          Nxt_table_index = 0;
          Prev_table_index = 0;
          uint8_t done_rx_start = 1;
          if(Current_Circle == MIN_CIRCLE)
          {

                for(neighbour_no = MIN_NODES; neighbour_no < MAX_NODES ;)
                {

                        if(Ack_Txing == 0)
                        {
                              nrf_esb_stop_rx();
                              set_slave_adress( neighbour_no ,arrays[Current_Circle + 1]);
                              memset(&header,0,sizeof(header));
                              header.packet_type = 1;
                              header.length = 1;
                              header.circle_array[Current_Circle] = addr_prefix[0];
                              memcpy(tx_payload.data,&header,sizeof(header));
                              memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                              tx_payload.length = (sizeof(header) + sizeof("HAI"));
                              done_rx_start = 1;
                              if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                              {
                                    nrf_delay_us(50000); //to send the data 
                                    //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);

                              }
                        }
                        if(done_rx_start == 1 && Ack_Txing == 1)
                        {
                                done_rx_start = 0;
                                nrf_esb_flush_tx();
                                nrf_esb_flush_rx();
                                set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                                nrf_esb_start_rx();
                        }

                }
                Diagnostic_Test = 0;
          }
          else if(Current_Circle == MAX_CIRCLE)
          {

                for(neighbour_no = MIN_NODES; neighbour_no < MAX_NODES ;)
                {
                      if(Ack_Txing == 0)
                      {
                            nrf_esb_stop_rx();
                            set_slave_adress( neighbour_no ,arrays[Current_Circle - 1]);
                            memset(&header,0,sizeof(header));
                            header.packet_type = 1;
                            header.length = 1;
                            header.circle_array[Current_Circle] = addr_prefix[0];
                            memcpy(tx_payload.data,&header,sizeof(header));
                            memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                            tx_payload.length = (sizeof(header) + sizeof("HAI"));
                            done_rx_start = 1;
                            if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                            {
                                  nrf_delay_us(50000); //to send the data 
                                  //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                                  //   nrf_esb_start_rx();
                            }
                      }
                      if(done_rx_start == 1 && Ack_Txing == 1)
                      {
                              done_rx_start = 0;
                              nrf_esb_flush_tx();
                              nrf_esb_flush_rx();
                              set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                              nrf_esb_start_rx();
                      }

